# GetLineWeights Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWGImportOptions..::..GetLineWeights Method
DWGImportOptions Class See Also
---
Gets array of line weights.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<int> GetLineWeights()
```

Visual Basic
---
```text
Public Function GetLineWeights As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetLineWeights()
```

# See Also
DWGImportOptions Class
Autodesk.Revit.DB Namespace